/* 
filter() : 
    1. 배열의 메소드이다.
    2. 새로운 배열을 반환하는 함수이다.
    3. 참/거짓, 또는 참/거짓을 반환하는 함수를 인자로 가진다.
forEach() : 
    1. 배열의 메소드이다.
    2. 반환값이 없는 함수이다.
    3. 모든 '행위'를 인자로 가질 수 있다.

arrow function : 
    1. 배열 메소드의 인자로써 작동할 떄에는 (요소, 인덱스, 원본 배열) => ... 로 매핑된다 (위치는 고정)
    2. `_` 를 사용해 적절히 매핑할 수 있다. (개발자들끼리 이건 빈칸이다 라고 한다는 얘기가...)

"아무것도 하지 않는" 구문 : 
    1. 빈 블록 {}
    2. 끝에 세미콜론
    3. void 0 또는 void(0)
    4. 화살표 함수 + undefined
    5. 조건문을 생략하는 것

reduce() 함수 ; 
    1. 배열의 메소드이다.
    2. 반환값이 있는 함수이다.
    3. (누적값, 현재 요소, 현재 인덱스, 원본 배열) 순서로 매핑된다.
    4. 두 번쨰 인자는 기본값이다.
*/
